## JOINS

# SQL JOIN

* A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

# Different Types of SQL JOINs

<img src = 'https://theartofpostgresql.com/img/SQL-JOINS-Example-0.png'>

Here are the different types of the JOINs in SQL:

* (INNER) JOIN: Returns records that have matching values in both tables
* LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
* RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
* FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

# Let's look at a selection from the "Orders" table:

# Then, look at a selection from the "Customers" table:

In [28]:
# Creating data for joins illustration
import pandas as pd

orders=pd.DataFrame({
    "OrderID":[10308,10309,10310],
    "CustomerID":[2,37,77],
    "OrderDate":[1996-9-18,1996-9-19,1996-9-20]
})

customers=pd.DataFrame({
    "CustomerID":[1,2,3],
    "CustomerName":["Pavan","Priyanka","Sanvee"],
    "ContactName":["Kumar","Pinky","Guna"],
    "City":["Kurnool","Hyderabad","Bangalore"]
})

print("Orders Table")
print(orders)
print('\n')
print("Customers Table")
print(customers)

Orders Table
   OrderID  CustomerID  OrderDate
0    10308           2       1969
1    10309          37       1968
2    10310          77       1967


Customers Table
   CustomerID CustomerName ContactName       City
0           1        Pavan       Kumar    Kurnool
1           2     Priyanka       Pinky  Hyderabad
2           3       Sanvee        Guna  Bangalore

* Notice that the "CustomerID" column in the "Orders" table refers to the "CustomerID" in the "Customers" table. The relationship between the two tables above is the "CustomerID" column.

* Then, we can create the following SQL statement (that contains an INNER JOIN), that selects records that have matching values in both tables:

# The simplest Join is INNER JOIN.

* INNER JOIN: The INNER JOIN keyword selects all rows from both the tables as long as the condition satisfies. This keyword will create the result-set by combining all rows from both the tables where the condition satisfies i.e value of the common field will be same.

## Syntax:
* SELECT table1.column1,table1.column2,table2.column1,....
* FROM orders
* INNER JOIN customers
* ON orders.CustomerID = customers.CustomerID;


* table1: orders table.
* table2: customers table
* matching_column: Column common to both the tables is CustomerID.

               Note: We can also write JOIN instead of INNER JOIN. JOIN is same as INNER JOIN.

<img src = 'https://blog.codinghorror.com/content/images/uploads/2007/10/6a0120a85dcdae970b012877702708970c-pi.png'>

In [29]:
# In orders and Customers table common column is CustomerID
# Common value inside both CustomerID columns is 2, so only called inner
# So The data from both tables are merged accordingly 
inner_join = pd.merge(orders,customers,on = "CustomerID",how = "inner") 
inner_join

   OrderID  CustomerID  OrderDate CustomerName ContactName       City
0    10308           2       1969     Priyanka       Pinky  Hyderabad

## LEFT JOIN: 
* This join returns all the rows of the table on the left side of the join and matching rows for the table on the right side of join. The rows for which there is no matching row on right side, the result-set will contain null. LEFT JOIN is also known as LEFT OUTER

# LEFT OUTER JOIN.Syntax:
* SELECT orders.column1,orders.column2,customers.column1,....
* FROM table1 
* LEFT JOIN customers
* ON orders.CustomerID = table2.CustomerID;


* table1: orders
* table2: customers
* matching_column: Column common to both the tables.

                 Note: We can also use LEFT OUTER JOIN instead of LEFT JOIN, both are same.

<img src ='https://i.stack.imgur.com/VkAT5.png'>

In [30]:
# In orders table left column orderID will match with the values present in right side of customers table
# if no mathces it wil return NaN known as null value
left_join = pd.merge(orders,customers,on = "CustomerID",how = "left") 
left_join

   OrderID  CustomerID  OrderDate CustomerName ContactName       City
0    10308           2       1969     Priyanka       Pinky  Hyderabad
1    10309          37       1968          NaN         NaN        NaN
2    10310          77       1967          NaN         NaN        NaN

## Right Join
* RIGHT JOIN is similar to LEFT JOIN. This join returns all the rows of the table on the right side of the join and matching rows for the table on the left side of join. The rows for which there is no matching row on left side, the result-set will contain null. RIGHT JOIN is also known as RIGHT OUTER JOIN.

# Syntax:
* SELECT orders.column1,orders.column2,customers.column1,....
* FROM orders
* RIGHT JOIN customers
* ON orders.ColumnID = customers.ColumnID;


* table1: oders
* table2: customers
* matching_column: Column common to both the tables is CustomerID
* Note: We can also use RIGHT OUTER JOIN instead of RIGHT JOIN, both are same.

<img src='https://www.tutorialrepublic.com/lib/images/right-join.png'>

In [33]:
print(orders)
print(customers)

   OrderID  CustomerID  OrderDate
0    10308           2       1969
1    10309          37       1968
2    10310          77       1967
   CustomerID CustomerName ContactName       City
0           1        Pavan       Kumar    Kurnool
1           2     Priyanka       Pinky  Hyderabad
2           3       Sanvee        Guna  Bangalore

In [36]:
right_join = pd.merge(orders,customers,on = "CustomerID",how = "right") 
right_join

   OrderID  CustomerID  OrderDate CustomerName ContactName       City
0      NaN           1        NaN        Pavan       Kumar    Kurnool
1  10308.0           2     1969.0     Priyanka       Pinky  Hyderabad
2      NaN           3        NaN       Sanvee        Guna  Bangalore

# Full Join

# FULL JOIN: 
FULL JOIN creates the result-set by combining result of both LEFT JOIN and RIGHT JOIN. The result-set will contain all the rows from both the tables. The rows for which there is no matching, the result-set will contain NULL values.

# Syntax:
* SELECT orders.column1,orders.column2,customers.column1,....
* FROM orders
* FULL JOIN customers
* ON orders.CustomerID = customers.CustomerID;


* table1: orders.
* table2: customers
* matching_column: Column common to both the tables is CustomerID

<img src = 'https://i.stack.imgur.com/3Ll1h.png'>

In [35]:
# fulljoin here is given as how = "outer"
# 
full_join = pd.merge(orders,customers,on = "CustomerID",how = "outer") 
full_join

   OrderID  CustomerID  OrderDate CustomerName ContactName       City
0  10308.0           2     1969.0     Priyanka       Pinky  Hyderabad
1  10309.0          37     1968.0          NaN         NaN        NaN
2  10310.0          77     1967.0          NaN         NaN        NaN
3      NaN           1        NaN        Pavan       Kumar    Kurnool
4      NaN           3        NaN       Sanvee        Guna  Bangalore

In [42]:
# Creating data for joins illustration
import pandas as pd

data1 ={
    "name":["Sanjeevanath","Pavan","Mallik"],
       "age":[72,36,38]
}

data2 = {
    "name":["Sasikala","Priyanka","Teja Jyothi"],
    "age":[62,32,36]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

newdf = df1.merge(df2, how='right') # want to merge using right joint
print(newdf)

          name  age
0     Sasikala   62
1     Priyanka   32
2  Teja Jyothi   36

In [44]:
df1

           name  age
0  Sanjeevanath   72
1         Pavan   36
2        Mallik   38

In [45]:
df2

          name  age
0     Sasikala   62
1     Priyanka   32
2  Teja Jyothi   36

In [41]:
# By default how = "inner"
df3 = pd.merge(df1,df2,on = "name",how = "outer")
df3

           name  age_x  age_y
0  Sanjeevanath   72.0    NaN
1         Pavan   36.0    NaN
2        Mallik   38.0    NaN
3      Sasikala    NaN   62.0
4      Priyanka    NaN   32.0
5   Teja Jyothi    NaN   36.0

In [46]:
df3 = pd.merge(df1,df2,on = "name",how = "left")
df3

           name  age_x  age_y
0  Sanjeevanath     72    NaN
1         Pavan     36    NaN
2        Mallik     38    NaN

In [48]:
df3 = pd.merge(df1,df2,on = "name",how = "right")
df3

          name  age_x  age_y
0     Sasikala    NaN     62
1     Priyanka    NaN     32
2  Teja Jyothi    NaN     36